<?php
/**
 * eBestCMS
 * ============================================================================
 * Copyright © 2015-2018 HongYuKeJi.Co.Ltd. All rights reserved.
 * Http://www.hongyuvip.com
 * ----------------------------------------------------------------------------
 * 仅供学习交流使用，如需商用请购买商用版权。
 * 堂堂正正做人，踏踏实实做事。
 * ----------------------------------------------------------------------------
 * Author: Shadow  QQ: 1527200768  Time: 2018/7/6 17:05
 * E-mail: admin@hongyuvip.com
 * ============================================================================
 */

return [

    /*
    |--------------------------------------------------------------------------
    | customized http code
    |--------------------------------------------------------------------------
    |
    | The first number is error type, the second and third number is
    | product type, and it is a specific error code from fourth to
    | sixth.But the success is different.
    | 状态信息归类：如4--为用户端错误，5--位服务器端错误，2--为请求成功
    |
    */

    'code' => [
        200 => '成功',
        200001 => '缺少必要的参数',

        //文章
        503001 => '上传文件的格式不正确',
        503002 => '同步成功-记录保存失败',
        503003 => '权限错误',
        503004 => '文章保存失败',
        403017 => '临近定时时间不能取消发送任务',
        403018 => '临近定时时间不能修改发送任务',
        403019 => '超过发送时间不能发送',
        403020 => '缺少发表记录ID参数',

        //SMS
        416001 => '添加成功,审核中,请耐心等待',
        416002 => '签名添加失败',
    ],

];